blood-RAS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;   		// This is the fluid velocity at the various boundaries
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet-I
    {
        type		uniformFixedValue;
        uniformValue	table
	(
		(0 (15 0 0))
		(5 (0 0 0))
	);
    }

    inletWall-III
    {
        type		 fixedValue;
	value		uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
	value		$internalField;

/*
	type		inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
*/
    }

    topWall
    {
        type            zeroGradient;
    }

    internalWall
    {
        type		 fixedValue;
	value		uniform (0 0 0);
    }

    #include "include/patchesWalls"

}

// ************************************************************************* //

